Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_telemetry_bm_bg96/Secure/firmware/src/packs/PIC32CM5164LS60100_DFP/component/sercom.h
/* -------- SERCOM_USART_EXT_CTRLC : (SERCOM Offset: 0x08) (R/W 32) USART_EXT Control C -------- */
#define SERCOM_USART_EXT_CTRLC_RESETVALUE     _UINT32_(0x00)                                       /*  (SERCOM_USART_EXT_CTRLC) USART_EXT Control C  Reset Value */

#define SERCOM_USART_EXT_CTRLC_GTIME_Pos      _UINT32_(0)                                          /* (SERCOM_USART_EXT_CTRLC) Guard Time Position */
#define SERCOM_USART_EXT_CTRLC_GTIME_Msk      (_UINT32_(0x7) << SERCOM_USART_EXT_CTRLC_GTIME_Pos)  /* (SERCOM_USART_EXT_CTRLC) Guard Time Mask */
#define SERCOM_USART_EXT_CTRLC_GTIME(value)   (SERCOM_USART_EXT_CTRLC_GTIME_Msk & (_UINT32_(value) << SERCOM_USART_EXT_CTRLC_GTIME_Pos)) /* Assigment of value for GTIME in the SERCOM_USART_EXT_CTRLC register */
#define SERCOM_USART_EXT_CTRLC_BRKLEN_Pos     _UINT32_(8)                                          /* (SERCOM_USART_EXT_CTRLC) LIN Master Break Length Position */
#define SERCOM_USART_EXT_CTRLC_BRKLEN_Msk     (_UINT32_(0x3) << SERCOM_USART_EXT_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_EXT_CTRLC) LIN Master Break Length Mask */
#define SERCOM_USART_EXT_CTRLC_BRKLEN(value)  (SERCOM_USART_EXT_CTRLC_BRKLEN_Msk & (_UINT32_(value) << SERCOM_USART_EXT_CTRLC_BRKLEN_Pos)) /* Assigment of value for BRKLEN in the SERCOM_USART_EXT_CTRLC register */
#define   SERCOM_USART_EXT_CTRLC_BRKLEN_13_BIT_Val _UINT32_(0x0)                                        /* (SERCOM_USART_EXT_CTRLC) Break field transmission is 13 bit times  */
#define   SERCOM_USART_EXT_CTRLC_BRKLEN_17_BIT_Val _UINT32_(0x1)                                        /* (SERCOM_USART_EXT_CTRLC) Break field transmission is 17 bit times  */
#define   SERCOM_USART_EXT_CTRLC_BRKLEN_21_BIT_Val _UINT32_(0x2)                                        /* (SERCOM_USART_EXT_CTRLC) Break field transmission is 21 bit times  */
#define   SERCOM_USART_EXT_CTRLC_BRKLEN_26_BIT_Val _UINT32_(0x3)                                        /* (SERCOM_USART_EXT_CTRLC) Break field transmission is 26 bit times  */
#define SERCOM_USART_EXT_CTRLC_BRKLEN_13_BIT  (SERCOM_USART_EXT_CTRLC_BRKLEN_13_BIT_Val << SERCOM_USART_EXT_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_EXT_CTRLC) Break field transmission is 13 bit times Position  */
#define SERCOM_USART_EXT_CTRLC_BRKLEN_17_BIT  (SERCOM_USART_EXT_CTRLC_BRKLEN_17_BIT_Val << SERCOM_USART_EXT_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_EXT_CTRLC) Break field transmission is 17 bit times Position  */
#define SERCOM_USART_EXT_CTRLC_BRKLEN_21_BIT  (SERCOM_USART_EXT_CTRLC_BRKLEN_21_BIT_Val << SERCOM_USART_EXT_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_EXT_CTRLC) Break field transmission is 21 bit times Position  */
#define SERCOM_USART_EXT_CTRLC_BRKLEN_26_BIT  (SERCOM_USART_EXT_CTRLC_BRKLEN_26_BIT_Val << SERCOM_USART_EXT_CTRLC_BRKLEN_Pos) /* (SERCOM_USART_EXT_CTRLC) Break field transmission is 26 bit times Position  */
#define SERCOM_USART_EXT_CTRLC_HDRDLY_Pos     _UINT32_(10)                                         /* (SERCOM_USART_EXT_CTRLC) LIN Master Header Delay Position */
#define SERCOM_USART_EXT_CTRLC_HDRDLY_Msk     (_UINT32_(0x3) << SERCOM_USART_EXT_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_EXT_CTRLC) LIN Master Header Delay Mask */
#define SERCOM_USART_EXT_CTRLC_HDRDLY(value)  (SERCOM_USART_EXT_CTRLC_HDRDLY_Msk & (_UINT32_(value) << SERCOM_USART_EXT_CTRLC_HDRDLY_Pos)) /* Assigment of value for HDRDLY in the SERCOM_USART_EXT_CTRLC register */
#define   SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY0_Val _UINT32_(0x0)                                        /* (SERCOM_USART_EXT_CTRLC) Delay between break and sync transmission is 1 bit time; Delay between sync and ID transmission is 1 bit time  */
#define   SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY1_Val _UINT32_(0x1)                                        /* (SERCOM_USART_EXT_CTRLC) Delay between break and sync transmission is 4 bit time; Delay between sync and ID transmission is 4 bit time  */
#define   SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY2_Val _UINT32_(0x2)                                        /* (SERCOM_USART_EXT_CTRLC) Delay between break and sync transmission is 8 bit time; Delay between sync and ID transmission is 4 bit time  */
#define   SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY3_Val _UINT32_(0x3)                                        /* (SERCOM_USART_EXT_CTRLC) Delay between break and sync transmission is 14 bit time; Delay between sync and ID transmission is 4 bit time  */
#define SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY0  (SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY0_Val << SERCOM_USART_EXT_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_EXT_CTRLC) Delay between break and sync transmission is 1 bit time; Delay between sync and ID transmission is 1 bit time Position  */
#define SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY1  (SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY1_Val << SERCOM_USART_EXT_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_EXT_CTRLC) Delay between break and sync transmission is 4 bit time; Delay between sync and ID transmission is 4 bit time Position  */
#define SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY2  (SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY2_Val << SERCOM_USART_EXT_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_EXT_CTRLC) Delay between break and sync transmission is 8 bit time; Delay between sync and ID transmission is 4 bit time Position  */
#define SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY3  (SERCOM_USART_EXT_CTRLC_HDRDLY_DELAY3_Val << SERCOM_USART_EXT_CTRLC_HDRDLY_Pos) /* (SERCOM_USART_EXT_CTRLC) Delay between break and sync transmission is 14 bit time; Delay between sync and ID transmission is 4 bit time Position  */
#define SERCOM_USART_EXT_CTRLC_INACK_Pos      _UINT32_(16)                                         /* (SERCOM_USART_EXT_CTRLC) Inhibit Not Acknowledge Position */
#define SERCOM_USART_EXT_CTRLC_INACK_Msk      (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLC_INACK_Pos)  /* (SERCOM_USART_EXT_CTRLC) Inhibit Not Acknowledge Mask */
#define SERCOM_USART_EXT_CTRLC_INACK(value)   (SERCOM_USART_EXT_CTRLC_INACK_Msk & (_UINT32_(value) << SERCOM_USART_EXT_CTRLC_INACK_Pos)) /* Assigment of value for INACK in the SERCOM_USART_EXT_CTRLC register */
#define SERCOM_USART_EXT_CTRLC_DSNACK_Pos     _UINT32_(17)                                         /* (SERCOM_USART_EXT_CTRLC) Disable Successive NACK Position */
#define SERCOM_USART_EXT_CTRLC_DSNACK_Msk     (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLC_DSNACK_Pos) /* (SERCOM_USART_EXT_CTRLC) Disable Successive NACK Mask */
#define SERCOM_USART_EXT_CTRLC_DSNACK(value)  (SERCOM_USART_EXT_CTRLC_DSNACK_Msk & (_UINT32_(value) << SERCOM_USART_EXT_CTRLC_DSNACK_Pos)) /* Assigment of value for DSNACK in the SERCOM_USART_EXT_CTRLC register */
#define SERCOM_USART_EXT_CTRLC_MAXITER_Pos    _UINT32_(20)                                         /* (SERCOM_USART_EXT_CTRLC) Maximum Iterations Position */
#define SERCOM_USART_EXT_CTRLC_MAXITER_Msk    (_UINT32_(0x7) << SERCOM_USART_EXT_CTRLC_MAXITER_Pos) /* (SERCOM_USART_EXT_CTRLC) Maximum Iterations Mask */
#define SERCOM_USART_EXT_CTRLC_MAXITER(value) (SERCOM_USART_EXT_CTRLC_MAXITER_Msk & (_UINT32_(value) << SERCOM_USART_EXT_CTRLC_MAXITER_Pos)) /* Assigment of value for MAXITER in the SERCOM_USART_EXT_CTRLC register */
#define SERCOM_USART_EXT_CTRLC_DATA32B_Pos    _UINT32_(24)                                         /* (SERCOM_USART_EXT_CTRLC) Data 32 Bit Position */
#define SERCOM_USART_EXT_CTRLC_DATA32B_Msk    (_UINT32_(0x3) << SERCOM_USART_EXT_CTRLC_DATA32B_Pos) /* (SERCOM_USART_EXT_CTRLC) Data 32 Bit Mask */
#define SERCOM_USART_EXT_CTRLC_DATA32B(value) (SERCOM_USART_EXT_CTRLC_DATA32B_Msk & (_UINT32_(value) << SERCOM_USART_EXT_CTRLC_DATA32B_Pos)) /* Assigment of value for DATA32B in the SERCOM_USART_EXT_CTRLC register */
#define   SERCOM_USART_EXT_CTRLC_DATA32B_0x0_Val _UINT32_(0x0)                                        /* (SERCOM_USART_EXT_CTRLC) Reads and writes with CHSIZE  */
#define   SERCOM_USART_EXT_CTRLC_DATA32B_0x1_Val _UINT32_(0x1)                                        /* (SERCOM_USART_EXT_CTRLC) Reads with CHSIZE, writes with 32-bit extension  */
#define   SERCOM_USART_EXT_CTRLC_DATA32B_0x2_Val _UINT32_(0x2)                                        /* (SERCOM_USART_EXT_CTRLC) Reads with 32-bit extension, writes with CHSIZE  */
#define   SERCOM_USART_EXT_CTRLC_DATA32B_0x3_Val _UINT32_(0x3)                                        /* (SERCOM_USART_EXT_CTRLC) Reads and writes with 32-bit extension  */
#define SERCOM_USART_EXT_CTRLC_DATA32B_0x0    (SERCOM_USART_EXT_CTRLC_DATA32B_0x0_Val << SERCOM_USART_EXT_CTRLC_DATA32B_Pos) /* (SERCOM_USART_EXT_CTRLC) Reads and writes with CHSIZE Position  */
#define SERCOM_USART_EXT_CTRLC_DATA32B_0x1    (SERCOM_USART_EXT_CTRLC_DATA32B_0x1_Val << SERCOM_USART_EXT_CTRLC_DATA32B_Pos) /* (SERCOM_USART_EXT_CTRLC) Reads with CHSIZE, writes with 32-bit extension Position  */
#define SERCOM_USART_EXT_CTRLC_DATA32B_0x2    (SERCOM_USART_EXT_CTRLC_DATA32B_0x2_Val << SERCOM_USART_EXT_CTRLC_DATA32B_Pos) /* (SERCOM_USART_EXT_CTRLC) Reads with 32-bit extension, writes with CHSIZE Position  */
#define SERCOM_USART_EXT_CTRLC_DATA32B_0x3    (SERCOM_USART_EXT_CTRLC_DATA32B_0x3_Val << SERCOM_USART_EXT_CTRLC_DATA32B_Pos) /* (SERCOM_USART_EXT_CTRLC) Reads and writes with 32-bit extension Position  */
#define SERCOM_USART_EXT_CTRLC_FIFOEN_Pos     _UINT32_(27)                                         /* (SERCOM_USART_EXT_CTRLC) FIFO Enable Position */
#define SERCOM_USART_EXT_CTRLC_FIFOEN_Msk     (_UINT32_(0x1) << SERCOM_USART_EXT_CTRLC_FIFOEN_Pos) /* (SERCOM_USART_EXT_CTRLC) FIFO Enable Mask */
#define SERCOM_USART_EXT_CTRLC_FIFOEN(value)  (SERCOM_USART_EXT_CTRLC_FIFOEN_Msk & (_UINT32_(value) << SERCOM_USART_EXT_CTRLC_FIFOEN_Pos)) /* Assigment of value for FIFOEN in the SERCOM_USART_EXT_CTRLC register */
#define SERCOM_USART_EXT_CTRLC_RXTRHOLD_Pos   _UINT32_(28)                                         /* (SERCOM_USART_EXT_CTRLC) Receive FIFO Threshold Position */
#define SERCOM_USART_EXT_CTRLC_RXTRHOLD_Msk   (_UINT32_(0x3) << SERCOM_USART_EXT_CTRLC_RXTRHOLD_Pos) /* (SERCOM_USART_EXT_CTRLC) Receive FIFO Threshold Mask */
#define SERCOM_USART_EXT_CTRLC_RXTRHOLD(value) (SERCOM_USART_EXT_CTRLC_RXTRHOLD_Msk & (_UINT32_(value) << SERCOM_USART_EXT_CTRLC_RXTRHOLD_Pos)) /* Assigment of value for RXTRHOLD in the SERCOM_USART_EXT_CTRLC register */
#define   SERCOM_USART_EXT_CTRLC_RXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO  */
#define   SERCOM_USART_EXT_CTRLC_RXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full  */
#define   SERCOM_USART_EXT_CTRLC_RXTRHOLD_FULL_Val _UINT32_(0x2)                                        /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated when FIFO is full  */
#define SERCOM_USART_EXT_CTRLC_RXTRHOLD_DEFAULT (SERCOM_USART_EXT_CTRLC_RXTRHOLD_DEFAULT_Val << SERCOM_USART_EXT_CTRLC_RXTRHOLD_Pos) /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO Position  */
#define SERCOM_USART_EXT_CTRLC_RXTRHOLD_HALF  (SERCOM_USART_EXT_CTRLC_RXTRHOLD_HALF_Val << SERCOM_USART_EXT_CTRLC_RXTRHOLD_Pos) /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full Position  */
#define SERCOM_USART_EXT_CTRLC_RXTRHOLD_FULL  (SERCOM_USART_EXT_CTRLC_RXTRHOLD_FULL_Val << SERCOM_USART_EXT_CTRLC_RXTRHOLD_Pos) /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated when FIFO is full Position  */
#define SERCOM_USART_EXT_CTRLC_TXTRHOLD_Pos   _UINT32_(30)                                         /* (SERCOM_USART_EXT_CTRLC) Transmit FIFO Threshold Position */
#define SERCOM_USART_EXT_CTRLC_TXTRHOLD_Msk   (_UINT32_(0x3) << SERCOM_USART_EXT_CTRLC_TXTRHOLD_Pos) /* (SERCOM_USART_EXT_CTRLC) Transmit FIFO Threshold Mask */
#define SERCOM_USART_EXT_CTRLC_TXTRHOLD(value) (SERCOM_USART_EXT_CTRLC_TXTRHOLD_Msk & (_UINT32_(value) << SERCOM_USART_EXT_CTRLC_TXTRHOLD_Pos)) /* Assigment of value for TXTRHOLD in the SERCOM_USART_EXT_CTRLC register */
#define   SERCOM_USART_EXT_CTRLC_TXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define   SERCOM_USART_EXT_CTRLC_TXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free  */
#define   SERCOM_USART_EXT_CTRLC_TXTRHOLD_EMPTY_Val _UINT32_(0x2)                                        /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated when the FIFO is empty  */
#define SERCOM_USART_EXT_CTRLC_TXTRHOLD_DEFAULT (SERCOM_USART_EXT_CTRLC_TXTRHOLD_DEFAULT_Val << SERCOM_USART_EXT_CTRLC_TXTRHOLD_Pos) /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position  */
#define SERCOM_USART_EXT_CTRLC_TXTRHOLD_HALF  (SERCOM_USART_EXT_CTRLC_TXTRHOLD_HALF_Val << SERCOM_USART_EXT_CTRLC_TXTRHOLD_Pos) /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free Position  */
#define SERCOM_USART_EXT_CTRLC_TXTRHOLD_EMPTY (SERCOM_USART_EXT_CTRLC_TXTRHOLD_EMPTY_Val << SERCOM_USART_EXT_CTRLC_TXTRHOLD_Pos) /* (SERCOM_USART_EXT_CTRLC) Interrupt and DMA triggers are generated when the FIFO is empty Position  */
#define SERCOM_USART_EXT_CTRLC_Msk            _UINT32_(0xFB730F07)                                 /* (SERCOM_USART_EXT_CTRLC) Register Mask  */


/* -------- SERCOM_USART_INT_CTRLC : (SERCOM Offset: 0x08) (R/W 32) USART_INT Control C -------- */
#define SERCOM_USART_INT_CTRLC_RESETVALUE     _UINT32_(0x00)                                       /*  (SERCOM_USART_INT_CTRLC) USART_INT Control C  Reset Value */

